In [1]:

# import pandas library
import pandas as pd
  
# dictionary with list object in values
details = {
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya','Shivangi'],
    'Age' : [23, 21, 22,21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}
  
# creating a Dataframe object
df = pd.DataFrame(details,columns = ['Name','Age','University'],
                  index = ['a', 'b', 'c', 'd'])
  
df

        Name  Age University
a      Ankit   23        BHU
b  Aishwarya   21        JNU
c    Shaurya   22         DU
d   Shivangi   21        BHU

In [2]:
#select the row with the maximum Age value, and the corresponding index is 'a'
df[df['Age'] == df['Age'].max()]

    Name  Age University
a  Ankit   23        BHU

In [3]:
#select the index of max Age value, which is consistent with the above result
df['Age'].idxmax()

'a'

In [5]:
#drop the row of index 'a'
df2 = df.drop('a')
df2

        Name  Age University
b  Aishwarya   21        JNU
c    Shaurya   22         DU
d   Shivangi   21        BHU

In [8]:
#drop the row by the index of max Age value
df3 = df.drop(df['Age'].idxmax())
df3

        Name  Age University
b  Aishwarya   21        JNU
c    Shaurya   22         DU
d   Shivangi   21        BHU

In [6]:
#index[1] means the second row
df4 = df.drop(df.index[1])
df4

       Name  Age University
a     Ankit   23        BHU
c   Shaurya   22         DU
d  Shivangi   21        BHU